# SetCellParamIdAndCategoryId Method (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
TableSectionData..::..SetCellParamIdAndCategoryId Method
TableSectionData Class See Also
---
# Overload List
| Name | Description |
| --- | --- |
| --- | --- | --- |
| SetCellParamIdAndCategoryId(Int32, ElementId, ElementId) | Sets a column's category and parameter Id |
| SetCellParamIdAndCategoryId(Int32, Int32, ElementId, ElementId) | Sets a cell's category and parameter Id |

# See Also
TableSectionData Class
TableSectionData Members
Autodesk.Revit.DB Namespace